package com.aimyskin.laserserialmodule.responseClassify.device808Classify;

public enum State808Enum {

    STATE_808_0000(0x0000, 0, "租赁", "0不可用。1可用。2可用，但有延迟。3不可用，但可以播放广告。4，进入调试状态"),
    STATE_808_0001(0x0001, 1, "主机版本号", "如6.2"),
    STATE_808_0002(0x0002, 2, "手柄型号", "0：无屏  1 有屏"),
    STATE_808_0003(0x0003, 3, "主机型号", "无"),
    STATE_808_0004(0x0004, 4, "设备编号1", "无"),
    STATE_808_0005(0x0005, 5, "设备编号2", "无"),
    STATE_808_0006(0x0006, 6, "设备编号3", "无"),
    STATE_808_0007(0x0007, 7, "设备编号4", "无"),
    STATE_808_0008(0x0008, 8, "设备编号5", "无"),
    STATE_808_0009(0x0009, 9, "设备编号6", "无"),
    STATE_808_000A(0x000A, 10, "设备编号7", "无"),
    STATE_808_000B(0x000B, 11, "设备编号8", "无"),
    STATE_808_000C(0x000C, 12, "写保护", "0不可写设备ID。1可写入"),
    STATE_808_000D(0x000D, 13, "激光脉冲和频率", "wide为脉宽单位为ms,uint8类型，  freq 为频率 WIDE*FREQ不能超过1s "),
    STATE_808_000E(0x000E, 14, "能量/光强", "能量范围为 1-100"),
    STATE_808_000F(0x000F, 15, "手柄制冷片温度", "温度精确到 0.1，上传为int16类型，/10为实际温度"),

    STATE_808_0010(0x0010, 16, "手柄制冷片挡位", "TARGET_TEMP为目标温度，有手柄温度传感器的有效，达到目标温度后维持再目标温度，RANK[7:0]为制冷挡位 0-100"),
    STATE_808_0011(0x0011, 17, "激光计数", "本次激光计数值,1个小时左右数据会满值，所以需要点击开始的时候发送指令清空"),
    STATE_808_0012(0x0012, 18, "流量/水位", "水位1 正常，0 报警"),
    STATE_808_0013(0x0013, 19, "水温", "温度精确到 0.1，上传为int16类型，/10为实际温度"),
    STATE_808_0014(0x0014, 20, "水温上下限", "高位最大值，地位最小值，无需*10，uint8类型"),
    STATE_808_0015(0x0015, 21, "状态", "HandKey手柄按键 1按下 0 抬起  H_Connec：手柄连接状态 1连接  FootKey 脚踏 1 踩下"),
    STATE_808_0016(0x0016, 22, "准备", "0 standby 1 ready "),
    STATE_808_0017(0x0017, 23, "激光头型号", "无"),
    STATE_808_0018(0x0018, 24, "温度目标值", "上面的重复了，目前使用上面的目标温度"),
    STATE_808_0019(0x0019, 25, "解除限制", "无"),

    STATE_808_001A(0x001A, 26, "本次运行时长", "无"),
    STATE_808_001B(0x001B, 27, "手柄总运行时长H", "无"),
    STATE_808_001C(0x001C, 28, "手柄总运行时长L", "无"),
    STATE_808_001D(0x001D, 29, "手柄总时长H", "无"),
    STATE_808_001E(0x001E, 30, "手柄总时长L", "无"),
    STATE_808_001F(0x001F, 31, "手柄总运行次数H", "无"),
    STATE_808_0020(0x0020, 32, "手柄总运行次数L", "无"),
    STATE_808_0021(0x0021, 33, "手柄总次数H", "无"),
    STATE_808_0022(0x0022, 34, "手柄总次数L", "无"),

    STATE_808_0023(0x0023, 35, "手柄程序版本号", "无"),

    STATE_808_0024(0x0024, 36, "手柄显示能量", "将屏幕显示的数据写入到设备中，提供给其他屏幕显示使用"),
    STATE_808_0025(0x0025, 37, "手柄显示制冷状态等级", "将屏幕显示的数据写入到设备中，提供给其他屏幕显示使用"),
    STATE_808_0026(0x0026, 38, "手柄显示次数1", "将屏幕显示的数据写入到设备中，提供给其他屏幕显示使用"),
    STATE_808_0027(0x0026, 39, "手柄显示次数2", "将屏幕显示的数据写入到设备中，提供给其他屏幕显示使用");


    int address;
    int index;
    String describe;
    String message;

    State808Enum(int address, int index, String describe, String message) {
        this.address = address;
        this.index = index;
        this.describe = describe;
        this.message = message;
    }

    public int getAddress() {
        return address;
    }

}
